{"base":"1.15","added":{"acacia_logs":"<ul><li>Used in the <a href=\"#blocks_logs_that_burn\">#logs_that_burn</a> block tag.</li></ul>","anvil":"<ul><li>Used to determine which blocks should open the anvil GUI. Does not work for any other blocks than the default ones. Removing any of the default blocks may cause the GUI to flash quickly before disappearing.</li>\n<li>Used to determine the damage source for entities being damaged by a falling block, which is used by the death messages.</li>\n<li>Used to determine if a block has a chance to get \"damaged\" or break upon landing.</li>\n<li>Blocks added receive only their falling block properties when summoned through commands. For example, sand does not harm entities unless summoned.</li>\n<li>Used in reading NBT from falling block entities to set the internal <code>HurtEntities</code> boolean to <code>true</code> if the entity did not have <code>HurtEntities</code> set.</li>\n<li>Used to determine if the block should have a chance to take damage from using the anvil GUI.</li></ul>","banners":"<ul><li>Used by maps upon clicking a block, to see if it should place a marker. Adding blocks to this animation causes maps to play the use animation when clicked, but no marker is added.</li>\n<li>Used in the <a href=\"#blocks_wall_post_override\">#wall_post_override</a> block tag.</li></ul>","base_stone_nether":"<ul><li>Used to determine what blocks <a class=\"mw-redirect\" href=\"/Ancient_debris\" title=\"Ancient debris\">ancient debris</a> can replace.</li></ul>","base_stone_overworld":"<ul><li>Used to determine what blocks dirt, gravel, granite, diorite, andesite, coal ore, iron ore, gold ore, redstone ore, diamond ore, lapis lazuli ore, and infested stone can replace when generated as underground ores.</li>\n<li>Used in the <a href=\"#blocks_dripstone_replaceable_blocks.E2.80.8C\">#dripstone_replaceable_blocks‌</a> block tag.</li></ul>","beacon_base_blocks":"<ul><li>Used by beacons to check which base blocks can  activate it.</li></ul>","beds":"<ul><li>Cats use this tag to determine where to sit or sleep with the player.</li>\n<li>Used to determine what blocks can be slept in by villagers.</li>\n<li>Used to determine what blocks baby villagers can jump on.</li>\n<li>Adding blocks to this tag has no effect on villagers. Villagers still pathfind to beds not in this tag, but they do not jump or sleep on them.</li></ul>","beehives":"<ul><li>Determines which blocks can fill with honey when a bee deposits pollen.</li>\n<li>Blocks in this tag can have honey removed by a dispenser with a glass bottle or shears.</li>\n<li>Used in the 'husbandry/safely_harvest_honey.json' advancement file.</li></ul>","birch_logs":"<ul><li>Used in the <a href=\"#blocks_logs_that_burn\">#logs_that_burn</a> block tag.</li></ul>","campfires":"<ul><li>Bees, parrots, and turtles view blocks in this tag as dealing fire damage and pathfind accordingly.</li>\n<li>Campfires use this tag to determine if they are lit or not.</li>\n<li>Flint and steel and fire charges use this tag to determine if it can light campfires. Adding blocks to this tag has no effect.</li>\n<li>Splash water bottles set the <code>lit</code> value of blocks in this tag to false.</li></ul>","climbable":"<ul><li>Used in mob pathfinding.</li>\n<li>This tag is used to determine what blocks the player can climb.</li>\n<li>For the player to be able to climb added blocks, the block must be small enough that the center of the player's hitbox can occupy the same block.</li>\n<li>This means that blocks such as chests cannot be climbed from the sides, but can from the top.</li>\n<li>If scaffolding is removed, the player cannot smoothly climb up, but can still jump up and crouch down.</li></ul>","crimson_stems":"<ul><li>Used in the <a href=\"/Tag#blocks_logs\" title=\"Tag\">#logs</a> block tag.</li></ul>","dark_oak_logs":"<ul><li>Used in the <a href=\"#blocks_logs_that_burn\">#logs_that_burn</a> block tag.</li></ul>","dragon_immune":"<ul><li>Used to determine what blocks the <a class=\"mw-redirect\" href=\"/Ender_dragon\" title=\"Ender dragon\">ender dragon</a> can't destroy.</li></ul>","fence_gates":"<ul><li>Used in the <a href=\"#blocks_unstable_bottom_center\">#unstable_bottom_center</a> block tag.</li></ul>","fences":"<ul><li>Mobs view all blocks in this tag as fences and pathfind accordingly.</li>\n<li>Leads can be attached to solid blocks in this tag.</li>\n<li>The lead knot entity uses this tag to determine if it should break or not.</li>\n<li>Fences in this tag attempt to connect only to other fences in this tag, but not in the <a href=\"/Tag#block_wooden_fences\" title=\"Tag\">#wooden_fences</a> block tag.</li>\n<li>Fences not in either tag do not connect to fences in the <a href=\"/Tag#block_wooden_fences\" title=\"Tag\">#wooden_fences</a> block tag.</li></ul>","fire":"<ul><li>Blocks in this tag are ignored when detecting valid unactivated nether portals, and get removed upon activation</li>\n<li>Mobs view all blocks in this tag as fire and pathfind accordingly.</li>\n<li>Blocks in this tag cannot stop falling blocks.</li>\n<li>Potions capable of dousing fire remove blocks in this tag.</li></ul>","gold_ores":"<ul><li>Used in the <a href=\"/Tag#blocks_guarded_by_piglins\" title=\"Tag\">#guarded_by_piglins</a> block tag.</li></ul>","guarded_by_piglins":"<ul><li>Piglins become hostile toward a player that destroys a block in this tag.</li>\n<li>This tag has no effect on which blocks cause piglins to become hostile when opened.</li></ul>","hoglin_repellents":"<ul><li><a href=\"/Hoglin\" title=\"Hoglin\">Hoglins</a> avoid blocks in this tag.</li></ul>","infiniburn_end":"<ul><li>Used in the infiniburn preset of the end dimension type (determines which blocks stay on fire forever in the end)</li></ul>","infiniburn_nether":"<ul><li>Used in the infiniburn preset of the nether dimension type (determines which blocks stay on fire forever in the nether)</li></ul>","infiniburn_overworld":"<ul><li>Used in the infiniburn preset of the overworld dimension type (determines which blocks stay on fire forever in the overworld)</li>\n<li>Used in the <a href=\"#blocks_infiniburn_nether\">#infiniburn_nether</a> and <a href=\"#blocks_infiniburn_end\">#infiniburn_end</a> block tags</li></ul>","jungle_logs":"<ul><li>Cocoa beans can be placed on blocks in this tag.</li>\n<li>Used in the <a href=\"#blocks_logs_that_burn\">#logs_that_burn</a> block tag.</li></ul>","leaves":"<ul><li>Blocks in this tag don't obstruct many features from generating, such as bonus chests, trees, and huge mushrooms.</li>\n<li>Used to determine placement rules for some transparent blocks</li>\n<li>Blocks in this tag are destroyed 1.5x faster than normal with swords</li>\n<li>Blocks in this tag are destroyed 15x faster than normal with shears and increment their stat usage</li>\n<li>Blocks is this tag recognize shears as a correct tool</li>\n<li>Parrots and ocelots can spawn in blocks in this tag</li></ul>","logs_that_burn":"<ul><li>Used in the <a href=\"/Tag#blocks_logs\" title=\"Tag\">#logs</a> block tag.</li></ul>","mushroom_grow_block":"<ul><li>Mushrooms can be placed on blocks in this tag regardless of light level</li>\n<li>Huge mushrooms can be grown on blocks in this tag regardless of light level</li></ul>","non_flammable_wood":"—","nylium":"<ul><li>Used as a check during generation certain vegetation in crimson and warped forests.</li>\n<li>Crimson and warped roots and nether sprouts can be placed on blocks in this tag, as well as soul soil.</li>\n<li>Netherrack is a valid bonemeal target only if a nearby block is in this tag, or if netherrack itself is in this tag.</li>\n<li>A non-nylium block nearby causes bonemeal to be consumed without producing anything when used on netherrack.</li>\n<li>It is still possible to spread nylium onto netherrack even if one or both nylium blocks are removed from the tag, as long as a block in the nylium tag is still nearby. This is because the check to grow nylium on the netherrack does not use the tag.</li>\n<li>Fungi can be placed on blocks in this tag, as well as mycelium and soul soil.<sup class=\"nowrap\" title=\"\">[<i><a class=\"external text\" href=\"https://minecraft.wiki/w/Talk:Tag\" target=\"_self\"><span style=\"border-bottom: 1px dotted\" title=\"This is what's directly stated in FungusBlock.java, why can they be placed on grass and such?\">more information needed</span></a></i>]</sup></li></ul>","oak_logs":"<ul><li>Used in the <a href=\"#blocks_logs_that_burn\">#logs_that_burn</a> block tag.</li></ul>","piglin_repellents":"<ul><li><a href=\"/Piglin\" title=\"Piglin\">Piglins</a> avoid blocks in this tag.</li></ul>","pressure_plates":"<ul><li>Used in the <a href=\"#blocks_wall_post_override\">#wall_post_override</a> block tag.</li></ul>","prevent_mob_spawning_inside":"<ul><li>Mobs cannot spawn inside blocks in this tag.</li></ul>","rails":"<ul><li>Minecarts can be placed and dispensed onto blocks in this tag.</li>\n<li>When TNT minecarts explode, blocks in this tag that the minecart is on have a blast resistance of 0.</li>\n<li>Used in determining rail directional placement. Adding blocks to this tag has no effect.</li>\n<li>Used in determining minecart speed. Adding blocks to this tag has no effect on this behavior.</li>\n<li>Used in the <a href=\"#blocks_prevent_mob_spawning_inside\">#prevent_mob_spawning_inside</a> block tag.</li></ul>","sand":"<ul><li>Used in the <a href=\"#blocks_bamboo_plantable_on\">#bamboo_plantable_on</a> block tag.</li>\n<li>Turtle eggs hatch when on a block in this tag.</li></ul>","shulker_boxes":"<ul><li>Fences, walls and panes do not connect to blocks in this tag.</li>\n<li>If blocks are removed from this tag, the above blocks still disconnect when the shulker box opens</li>\n<li>Used in the <a href=\"/Tag#blocks_guarded_by_piglins\" title=\"Tag\">#guarded_by_piglins</a> block tag.</li></ul>","signs":"<ul><li>Blocks in this tag are not destroyed by flowing water</li>\n<li>Removing blocks from this tag has no effect</li>\n<li>Used in the <a href=\"#blocks_wall_post_override\">#wall_post_override</a> block tag.</li></ul>","slabs":"<ul><li>Blocks in this tag are viewed as slabs by ruined portal generation.</li></ul>","soul_fire_base_blocks":"<ul><li>Blocks in this tag can support soul fire.</li></ul>","soul_speed_blocks":"<ul><li><a href=\"/Soul_Speed\" title=\"Soul Speed\">Soul Speed</a> increases the player's speed on blocks in this tag.</li></ul>","spruce_logs":"<ul><li>Used in the <a href=\"#blocks_logs_that_burn\">#logs_that_burn</a> block tag.</li></ul>","stairs":"<ul><li>Blocks in this tag are viewed as stairs by ruined portal generation.</li></ul>","stone_pressure_plates":"<ul><li>Used in the <a href=\"#blocks_pressure_plates\">#pressure_plates</a> block tag.</li></ul>","strider_warm_blocks":"<ul><li>Unless a <a href=\"/Strider\" title=\"Strider\">strider</a> is in a block in this tag, it shivers.</li></ul>","trapdoors":"<ul><li>Mobs treat all blocks in this tag as trapdoors when pathfinding</li>\n<li>Climbable blocks in this tag use the \"&lt;player&gt; fell off a ladder\" death message when applicable</li></ul>","unstable_bottom_center":"<ul><li>Blocks in this tag cannot support lanterns and bells on their bottom side even if they would otherwise be able to.</li></ul>","walls":"<ul><li>Mobs treat blocks in this tag as fences when pathfinding.</li>\n<li>Fence gates have the <code>in_wall</code> tag when next to a block in this tag.</li>\n<li>Other walls (not defined by the tag), glass panes, and iron bars attempt to connect to non-solid blocks in this tag.</li>\n<li>Blocks in this tag are viewed as walls by ruined portal generation.</li></ul>","wall_post_override":"<ul><li>Blocks in this tag cause walls to become pillars, even if they are not solid.</li></ul>","warped_stems":"<ul><li>Used in the <a href=\"/Tag#blocks_logs\" title=\"Tag\">#logs</a> block tag.</li></ul>","wart_blocks":"—","wither_summon_base_blocks":"<ul><li>Blocks in this tag can be used in the base to summon the <a href=\"/Wither\" title=\"Wither\">wither</a>.</li></ul>","wooden_fences":"<ul><li>Used in the <a href=\"#blocks_fences\">#fences</a> block tag.</li>\n<li>Fences in this tag attempt to connect to each other.</li>\n<li>Fences in the <a href=\"/Tag#block_fences\" title=\"Tag\">#fences</a> block tag do not attempt to connect to fences in this tag.</li>\n<li>Fences not in either tag do not connect to fences in this tag, including other fences of the same type.</li></ul>","wooden_pressure_plates":"<ul><li>Used in the <a href=\"#blocks_pressure_plates\">#pressure_plates</a> block tag.</li></ul>","wooden_stairs":"<ul><li>Used in the <a href=\"#blocks_stairs\">#stairs</a> block tag.</li></ul>","wool":"<ul><li>Blocks in this tag are broken 5× faster by shears and also increase the usage stat of shears.</li>\n<li>Placing blocks in this tag under a <a class=\"mw-redirect\" href=\"/Note_block\" title=\"Note block\">note block</a> sets the instrument used to guitar.</li>\n<li>If blocks that cause note blocks to play a different instrument are added to this tag, they cause the note block to play guitar.</li>\n<li>Used in the <a href=\"#block_occludes_vibration_signals\">#occludes_vibration_signals</a> block tag.</li></ul>"}}