{
    "anvil": "* Used to determine which blocks should open the anvil GUI. Does not work for any other blocks than the default ones. Removing any of the default blocks may cause the GUI to flash quickly before disappearing.\n* Used to determine the damage source for entities being damaged by a falling block, which is used by the death messages.\n* Used to determine if a block has a chance to get \"damaged\" or break upon landing. \n* Blocks added only recieve their falling block properties when summoned through commands. For example, sand will not harm entities unless summoned.\n* Used in reading NBT from falling block entities to set the internal <code> HurtEntities</code> boolean to <code> true</code> if the entity did not have <code> HurtEntities</code> set.\n* Used to determine if the block should have a chance to take damage from using the anvil GUI.",
    "bamboo_plantable_on": "*Used to check where bamboo can be planted",
    "banners": "* Used by maps upon clicking a block, to see if it should place a marker. Adding blocks to this animation will cause maps to play the use animation when clicked, but no marker will be added.",
    "beds": "* Used by cats to determine where to sit by themselves or lie down.\n* Used to validate villager points of interest\n* Used to determine what blocks can be slept in\n* Used to determine what blocks baby villagers can jump on\n* Adding blocks to this tag may cause the game to crash if they don't have head and foot parts",
    "beehives": "* Determines which blocks can fill with honey when a bee deposits pollen.\n* Blocks in this tag can have honey removed by a dispenser with a glass bottle or shears.\n* Adding blocks to this tag will cause the game to crash when attempting to use a glass bottle or shears on the block with a dispenser. It otherwise has no effects on other blocks.",
    "bee_growables": "* When bees pollinate these blocks they grow one stage.\n* Removing blocks from this tag has no effect.",
    "birch_logs": "",
    "buttons": "",
    "carpets": "",
    "corals": "* Used to generate coral reefs.",
    "coral_blocks": "* Used to generate coral reefs.\n* Using bone meal on a sea pickle on a block in this tag creates more sea pickles.",
    "coral_plants": "",
    "crops": "",
    "dark_oak_logs": "",
    "doors": "",
    "dragon_immune": "* Used to be determined what blocks Ender dragon can't destroy.",
    "enderman_holdable": "* Used to determine what blocks endermen can pick up.",
    "fences": "* Mobs view all blocks in this tag as fences and pathfind accordingly.\n* Leads can be attached to solid blocks in this tag.\n* The lead knot entity uses this tag to determine if it should break or not.",
    "flowers": "* Bees can pollinate and remember blocks in this tag",
    "flower_pots": "",
    "ice": "* Blocks in this tag do not act a surface for ocean ruins to generate on.",
    "jungle_logs": "*Cocoa beans can be placed on blocks in this tag.",
    "leaves": "* Blocks in this tag don't obstruct many features from generating, such as bonus chests, trees, and huge mushrooms.\n* Used to determine placement rules for some transparent blocks\n* Blocks in this tag are destroyed 1.5x faster than normal with swords\n* Blocks in this tag are destoryed 15x faster than normal with shears and increment their stat usage\n* Blocks is this tag recognize shears as a correct tool\n* Parrots and ocelots can spawn in blocks in this tag",
    "oak_logs": "",
    "planks": "",
    "portals": "* When an entity dismounts another entity, it will not be put in blocks in this tag to prevent unwanted teleportation and will instead dismount where the rided entity is.",
    "sand": "",
    "saplings": "*Trees can grow into blocks in this tag.",
    "shulker_boxes": "* Fences, walls and panes do not connect to blocks in this tag.",
    "signs": "* Blocks in this tag are not destroyed by flowing water",
    "slabs": "",
    "small_flowers": "* Bees attempt to pollinate blocks in this tag",
    "spruce_logs": "",
    "stairs": "",
    "standing_signs": "",
    "stone_bricks": "",
    "tall_flowers": "* Bees attempt to pollinate blocks in this tag",
    "trapdoors": "* Mobs treat all blocks in this tag as trapdoors when pathfinding",
    "underwater_bonemeals": "* Blocks in this tag replace water source blocks (within 5 horizontal and 2 vertical blocks) when bone meal is used under water in warm ocean biomes.\n* If the blocks in this tag are customized, the behavior is applied to water source blocks in any biome. These blocks are not waterlogged by default.",
    "valid_spawn": "* Used to determine if a location is a valid spawn position for the player.",
    "walls": "* Mobs treat blocks in this tag as fences when pathfinding.\n* Fence gates have the <code>in_wall</code> tag when next to a block in this tag.\n* <sup class=\"nowrap\" title=\"\">[<i><a target=\"_self\" class=\"external text\" href=\"https://minecraft.gamepedia.com/Template_talk:Needs_testing\"><span title=\"The statement is suspect and will require in-game testing to verify it.\" style=\"border-bottom: 1px dotted\">needs&nbsp;testing</span></a></i>]</sup>",
    "wall_corals": "* Used to generate coral reefs.",
    "wall_signs": "",
    "wither_immune": "* Used to be determined what blocks Wither can't destroy.",
    "wooden_buttons": "* Used in the 'buttons.json' block tag file.",
    "wooden_doors": "* Used in the 'doors.json' block tag file.\n* Villagers use this tag to detect doors",
    "wooden_fences": "",
    "wooden_pressure_plates": "",
    "wooden_slabs": "",
    "wooden_stairs": "",
    "wooden_trapdoors": "",
    "wool": "*Blocks in this tag are broken 5Ã— faster by shears and also increase the usage stat of shears.\n*Placing blocks in this tag under a note block sets the instrument used to guitar."
}