{"added": {"candle_cakes": "<ul><li>Blocks in this tag are considered candle cakes and can be lit, if they have the <code>lit</code> block state set to false.</li></ul>", "candles": "<ul><li>Blocks in this tag are considered candles and can be lit, if they have the <code>lit</code>, and <code>waterlogged</code> block state and both are false.</li></ul>", "cauldrons": "<ul><li>This tag is used in certain pathfinding processes.<sup class=\"nowrap\" title=\"\">[<i><a class=\"text\" href=\"https://minecraft.fandom.com/wiki/Talk:Tag\" target=\"_self\"><span style=\"border-bottom: 1px dotted\" title=\"Not sure exactly what it's doing tbh\">more information needed</span></a></i>]</sup></li></ul>", "cave_vines": "<ul><li>Used in the <a href=\"#blocks_lush_plants_replaceable\">#lush_plants_replaceable</a> block tag.</li></ul>", "coal_ores": "—", "copper_ores": "—", "crystal_sound_blocks": "<ul><li>Blocks in this tag play play the \"amethyst block chime\" sound repeatedly for a short amount of time after being stepped on, gradually decreasing in volume.</li>\n<li>The initial step sound is not affected by this tag.</li></ul>", "deepslate_ore_replaceables": "<ul><li>Iron ore, redstone ore, gold ore, diamond ore, and lapis lazuli ore can generate in blocks in this tag, and if they do, they become their deepslate variant</li>\n<li>Infested stone (from blobs) that generates in a block in this tag generates as infested deepslate</li></ul>", "diamond_ores": "—", "dirt": "<ul><li>Grass, tall grass, ferns, tall ferns, sweet berry bushes, saplings, flowers, azaleas, sugar cane, and dead bushes can be placed on blocks in this tag.</li>\n<li>Pumpkins and melons can grow into blocks in this tag.</li>\n<li>Used in the <a href=\"/wiki/Tag#blocks_bamboo_plantable_on\" title=\"Tag\">#bamboo_plantable_on</a> and <a href=\"/wiki/Tag#blocks_enderman_holdable\" title=\"Tag\">#enderman_holdable</a> block tags.</li></ul>", "dripstone_replaceable_blocks": "<ul><li>Used in dripstone generation to determine what dripstone can replace and what pointed dripstone can generate on.</li></ul>", "emerald_ores": "—", "features_cannot_replace": "<ul><li>Blocks with this tag cannot be replaced by any generated features</li></ul>", "geode_invalid_blocks": "<ul><li>Amethyst geodes cannot try to generate inside blocks in this tag.</li></ul>", "inside_step_sound_blocks": "<ul><li>While the player walks <b>in</b> a block in this tag, the step sound noises of the sound type of the block are played instead of the noise of the below block.</li></ul>", "iron_ores": "—", "lapis_ores": "—", "lava_pool_stone_replaceables": "<ul><li>Blocks in this tag cannot be replaced by stone generated in lava pools.</li></ul>", "lush_ground_replaceable": "<ul><li>Rooted dirt from azalea trees and clay patches and pools in lush caves can replace blocks in this tag.</li></ul>", "mineable/axe": "<ul><li>Blocks in this tag are mined faster with axes.</li></ul>", "mineable/hoe": "<ul><li>Blocks in this tag are mined faster with hoes.</li></ul>", "mineable/pickaxe": "<ul><li>Blocks in this tag are mined faster with pickaxes.</li></ul>", "mineable/shovel": "<ul><li>Blocks in this tag are mined faster with shovels.</li></ul>", "moss_replaceable": "<ul><li>Blocks in this tag can be replaced with moss blocks when a nearby moss block has bone meal applied to it.</li></ul>", "needs_diamond_tool": "<ul><li>If a block in this tag requires a certain type tool to drop, it will require a diamond, or better, tool to drop.</li></ul>", "needs_iron_tool": "<ul><li>If a block in this tag requires a certain type tool to drop, it will require an iron, or better, tool to drop.</li></ul>", "needs_stone_tool": "<ul><li>If a block in this tag requires a certain type tool to drop, it will require a stone, or better, tool to drop.</li></ul>", "occludes_vibration_signals": "<ul><li>Blocks in this tag prevent sculk sensors from hearing vibrations if the block is between the sculk sensor and the vibration.</li></ul>", "redstone_ores": "—", "small_dripleaf_placeable": "<ul><li>Small dripleaves can be placed on blocks in this tag, even if there is no water in the block where the small dripleaf is being placed.</li></ul>", "snow": "<ul><li>Blocks in this tag turn blocks with a snowy variant below them (like grass) into said snow variant.</li></ul>", "stone_ore_replaceables": "<ul><li>Iron ore, redstone ore, gold ore, diamond ore, and lapis lazuli ore can generate as their stone variants in blocks in this tag</li>\n<li>Infested stone (from blobs) that generates in a block in this tag generate as infested stone</li></ul>"}, "base": "1.16"}